{
    "caprice": {
        "name": "Caprice",
        "title": "Caprice - A Notion Clone",
        "description": "Caprice is a clone of the popular note taking app Notion. I built it using React, Next.js, and Typescript, as well as TailWind for the styling. I used ConvexDB to store user data, and Clerk to provide user authentification. This app has a very similar feel and user experience compared to the real Notion, with an almost identical block-based text editing system. Users can create, edit, and delete notes, as well as create new pages and subpages. The app is fully responsive and works on all devices. ",
        "image": "/capriceCover.png",
        "technologies": ["React", "Typescript", "Next.js", "TailWind", "ConvexDB", "Clerk"],
        "github": "https://github.com/WillGraham36/caprice-notion-clone",
        "website": "https://caprice-note-taking-app.vercel.app/"
    },
    "food-finder": {
        "name": "Food Finder",
        "title": "Food Finder",
        "description": "Food Finder is a web app that allows users to search for recipes based on ingredients they have in their pantry. Users can enter the ingredients they have, and get back a list of recipes that can be made with those ingredients. It was built using JavaScript, HTML, and CSS, uses the Spoonacular API to search for recipes; displaying the results in a clean and easy-to-read format. Users can click on a recipe to view more details, including ingredients and instructions on how to make it",
        "image": "/foodFinderCover.png",
        "technologies": ["JavaScript", "Spoonacular API", "HTML/CSS"],
        "github": "https://github.com/WillGraham36/Food-Finder",
        "website": ""
    },
    "spotify-artist-playlist":{
        "name": "Spotify Artist Playlist Creator",
        "title": "Spotify Artist Playlist Creator",
        "description": "Spotify Artist Playlist Creator is a web app that allows users to create playlists filled with every song made by a given artist. Using Spotify's OAuth 2.0 authentification flow, the playlists the user makes will be directly added to their Spotify account after singing in. It was built using Python, Flask, and the Spotify API.",
        "image": "/spotifyArtistCreatorCover.png",
        "technologies": ["Python", "SpotifyAPI", "Flask", "HTML/CSS"],
        "github": "https://github.com/WillGraham36/Spotify-Artist-Playlist-Creator",
        "website": ""
    }
}